Revit 2027 API
InternalDefinition.Visible Property
Indicates if the parameter is visible in the Autodesk Revit user interface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Visible { get; }
Public Overridable ReadOnly Property Visible As Boolean
	Get
public:
virtual property bool Visible {
	bool get ();
}
abstract Visible : bool with get
override Visible : bool with get
Property Value
Boolean
Remarks
The visible property controls whether a shared parameter is hidden from the user. This is useful if you wish to add data to an element that is only meaningful to your application and not to the user. This value can only be set when the shared parameter definition is created.
See Also
Reference
InternalDefinition Class
Autodesk.Revit.DB Namespace